flipperdevices/flipperzero-firmware/applications/external/totp/lib/wolfssl/wolfcrypt/src/port/Espressif/esp32_sha.c
    /*
    ** After possibly changing the mode (above) handle current mode:
    */
    switch (ctx->mode) {
        case ESP32_SHA_INIT:
            /* Likely a fresh, new SHA, as desired. */
            ESP_LOGV(TAG, "Normal ESP32_SHA_INIT");
            break;

        case ESP32_SHA_HW:
            /* We're already in hardware mode, so release. */
            /* Interesting, but normal. */
            ESP_LOGV(TAG, ">> HW unlock.");

            /* During init is the ONLY TIME we call unlock.
            ** If there's a problem, likely some undesired operation
            ** outside of wolfSSL.
            */
            esp_sha_hw_unlock(ctx);
            ctx->mode = ESP32_SHA_INIT;
            break;

        case ESP32_SHA_HW_COPY:
            /* When we init during a known active HW copy, revert to SW. */
            ESP_LOGV(TAG, "Planned revert to SW during copy.");
            ctx->mode = ESP32_SHA_SW;
            break;

        case ESP32_SHA_SW:
            /* This is an interesting situation: likely a call when
            ** another SHA in progress, but copied. */
            ESP_LOGV(TAG, ">> SW Set to init.");
            ctx->mode = ESP32_SHA_INIT;
            break;

        case ESP32_SHA_FAIL_NEED_UNROLL:
            /* Oh, how did we get here? likely uninitialized SHA memory.
            ** User code logic may need attention. */
            ESP_LOGW(TAG, "ALERT: \nESP32_SHA_FAIL_NEED_UNROLL\n");
            ctx->mode = ESP32_SHA_INIT;
            break;

        default:
            /* Most likely corrupted memory. */
            ESP_LOGW(TAG, "ALERT: \nunexpected mode value: "
                          "%d \n", ctx->mode);
            ctx->mode = ESP32_SHA_INIT;
            break;
    } /* switch (ctx->mode)  */

    /* reminder: always start isfirstblock = 1 (true) when using HW engine */
    /* we're always on the first block at init time (not zero-based!) */
    ctx->isfirstblock = true;
    ctx->lockDepth = 0; /* new objects will always start with lock depth = 0 */

    return 0; /* Always return success. We assume all issues handled, above. */
} /* esp_sha_init_ctx */

/*
** internal SHA ctx copy for ESP HW
*/
int esp_sha_ctx_copy(struct wc_Sha* src, struct wc_Sha* dst)
{
    int ret;
    if (src->ctx.mode == ESP32_SHA_HW) {
        /* this is an interesting situation to copy HW digest to SW */
        ESP_LOGV(TAG, "esp_sha_ctx_copy esp_sha_digest_process");

        /* Get a copy of the HW digest, but don't process it. */
        ret = esp_sha_digest_process(dst, 0);
        if (ret == 0) {
            /* note we arrived here only because the src is already in HW mode */
            dst->ctx.mode = ESP32_SHA_HW_COPY; /* provide init hint to SW revert */

            /* initializer will be set during init */
            ret = esp_sha_init(&(dst->ctx), WC_HASH_TYPE_SHA);
            if (ret != 0) {
                ESP_LOGE(TAG, "Error during esp_sha_ctx_copy in esp_sha_init.");
            }
        }
        else {
            ESP_LOGE(TAG, "Error during esp_sha_ctx_copy in esp_sha_digest_process.");
        }

        if (dst->ctx.mode == ESP32_SHA_SW) {
            /* The normal revert to SW in copy is expected */
            ESP_LOGV(TAG, "Confirmed SHA Copy set to SW");
        }
        else {
            /* However NOT reverting to SW is not right.
            ** This should never happen. */
            ESP_LOGW(TAG, "SHA Copy NOT set to SW");
        }
    } /* (src->ctx.mode == ESP32_SHA_HW */
    else { /* src not in HW mode, ok to copy. */
        /*
        ** reminder XMEMCOPY, above: dst->ctx = src->ctx;
        ** No special HW init needed in SW mode.
        ** but we need to set our initializer breadcrumb: */
        dst->ctx.initializer = &(dst->ctx); /* assign new breadcrumb to dst */
        ret = 0;
    }

    return ret;
} /* esp_sha_ctx_copy */

/*
** internal sha224 ctx copy (no ESP HW)
*/
int esp_sha224_ctx_copy(struct wc_Sha256* src, struct wc_Sha256* dst)
{
    /* There's no 224 hardware on ESP32 */
    dst->ctx.initializer = &dst->ctx; /* assign the initializer to dst */

    /* always set to SW, as there's no ESP32 HW for SHA224.
    ** TODO: add support for ESP32-S2. ESP32-S3, ESP32-C3 here.
    */
    dst->ctx.mode = ESP32_SHA_SW;
    return 0;
} /* esp_sha224_ctx_copy */

/*
** internal sha256 ctx copy for ESP HW
*/
int esp_sha256_ctx_copy(struct wc_Sha256* src, struct wc_Sha256* dst)
{
    int ret;
    if (src->ctx.mode == ESP32_SHA_HW) {
        /* Get a copy of the HW digest, but don't process it. */
        ESP_LOGI(TAG, "esp_sha256_ctx_copy esp_sha512_digest_process");
        ret = esp_sha256_digest_process(dst, 0);

        if (ret == 0) {
            /* provide init hint to possibly SW revert */
            dst->ctx.mode = ESP32_SHA_HW_COPY;

            /* initializer breadcrumb will be set during init */
            ret = esp_sha_init(&(dst->ctx), WC_HASH_TYPE_SHA256 );
        }

        if (dst->ctx.mode == ESP32_SHA_SW) {
            ESP_LOGV(TAG, "Confirmed wc_Sha256 Copy set to SW");
        }
        else {
            ESP_LOGW(TAG, "wc_Sha256 Copy NOT set to SW");
        }
    } /* (src->ctx.mode == ESP32_SHA_HW) */
    else {
        ret = 0;
        /*
        ** reminder this happened in XMEMCOPY: dst->ctx = src->ctx;
        ** No special HW init needed in SW mode.
        ** but we need to set our initializer: */
        dst->ctx.initializer = &dst->ctx; /* assign the initializer to dst */
    } /* not (src->ctx.mode == ESP32_SHA_HW) */

    return ret;
} /* esp_sha256_ctx_copy */

/*
** internal sha384 ctx copy for ESP HW
*/
int esp_sha384_ctx_copy(struct wc_Sha512* src, struct wc_Sha512* dst)
{
    int ret;
    if (src->ctx.mode == ESP32_SHA_HW) {
        /* Get a copy of the HW digest, but don't process it. */
        ESP_LOGI(TAG, "esp_sha384_ctx_copy esp_sha512_digest_process");
        ret = esp_sha512_digest_process(dst, 0);
        if (ret == 0) {
            /* provide init hint to SW revert */
            dst->ctx.mode = ESP32_SHA_HW_COPY;

            /* initializer will be set during init */
            ret = esp_sha_init(&(dst->ctx), WC_HASH_TYPE_SHA384);
            if (ret != 0) {
                ESP_LOGE(TAG, "Error during esp_sha384_ctx_copy in esp_sha_init.");
            }
        }
        else {
            ESP_LOGE(TAG, "Error during esp_sha384_ctx_copy in esp_sha512_digest_process.");
        }

        /* just some diagnostic runtime info */
        if (dst->ctx.mode == ESP32_SHA_SW) {
            ESP_LOGV(TAG, "Confirmed wc_Sha512 Copy set to SW");
        }
        else {
            ESP_LOGW(TAG, "wc_Sha512 Copy NOT set to SW");
        }
    } /* src->ctx.mode == ESP32_SHA_HW */
    else {
        ret = 0;
        /*
        ** reminder this happened in XMEMCOPY, above: dst->ctx = src->ctx;
        ** No special HW init needed in SW mode.
        ** but we need to set our initializer: */
        dst->ctx.initializer = &dst->ctx; /* assign the initializer to dst */
    } /* not (src->ctx.mode == ESP32_SHA_HW) */

    return ret;
} /* esp_sha384_ctx_copy */

